"""
Урок 34 - Датаклассы в Python

Датаклассы в Python специальные классы которые являются своим своего рода синтаксическим сахаром Они упрощают создание обычных классов и избавляют нас от необходимости писать некоторые вещи Например они автоматически создают инициализатор а также автоматически описывают некоторые специальные методы
"""

from dataclasses import dataclass

@dataclass
class Employee:
    name: str
    last_name: str
    age: int


emp_1 = Employee("Иван", "Сергеев", 22)
print(emp_1)

# Employee(name='Иван', last_name='Сергеев', age=22) - я взял это из принта!
emp_1_str = repr(emp_1)
print(type(emp_1_str))

new_emp_1 = eval(emp_1_str)
print(type(new_emp_1))

"""
Встроенные в Python функции `repr` и `eval`.

`repr` пытается вызвать у экземпляра класса специальный метод `__repr__`, который обычно делается для того, чтобы можно было превратить объект из строки в представление. Это, как правило, технический метод: по умолчанию он возвращает название класса и идентификатор области оперативной памяти, если мы его не переопределили. Иначе, в dataclasses декоратор `@dataclass` описывает его так, что этот метод начинает возвращать Python-строку, которая способна восстановить экземпляр класса.

В свою очередь, когда мы используем функцию `repr` в коде, эта функция пытается вызвать у экземпляра класса этот метод. И так как мы использовали dataclass, мы получаем строку, по которой можем восстановить экземпляр обратно.

Когда мы используем функцию `eval`, она выполняет любую строку как Python-код. Если вы работаете с чужими посторонними данными, это может быть небезопасно. Но если это ваше небольшое приложение, то это вполне себе нормальная история: `eval` выполняет строку как Python-код.

И в нашем случае у нас есть строка, которая сможет восстановить экземпляр класса обратно. Таким образом, мы можем буквально двумя строками произвести сериализацию данных в строковый вид и десериализацию данных из строкового вида в экземпляр класса.
"""

