"""
Урок 34 - Датаклассы в Python

Датаклассы в Python специальные классы которые являются своим своего рода синтаксическим сахаром Они упрощают создание обычных классов и избавляют нас от необходимости писать некоторые вещи Например они автоматически создают инициализатор а также автоматически описывают некоторые специальные методы
"""

from dataclasses import dataclass

@dataclass
class Employee:
    name: str
    last_name: str
    age: int

    def __str__(self)->str:
        """
        Строковое представление объекта сделано для красивой печати экземпляров класса в вашем коде, чтобы это радовало ваш глаз. Когда НЕТ str - работает автоматичски repr
        """
        return f"Сотрудник: {self.name} {self.last_name}. Возраст: {self.age}"

    def __repr__(self)-> str:
        return f"Employee(name='{self.name}', last_name='{self.last_name}', age={self.age} )"


emp_1 = Employee("Иван", "Сергеев", 22)
print(emp_1)
# Сотрудник: Иван Сергеев. Возраст: 22 - Если str сделан
# Employee(name='Иван', last_name='Сергеев', age='22' ) - Если репр описан или нет - я это получу, потому что @dataclass это за на